<a href="https://colab.research.google.com/github/xNoix/100daysofcode/blob/main/Tarea2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Tarea 2

## Integrantes

1. Nombre1 Apellido1
2. Nombre2 Apellido2
3. Nombre3 Apellido3

## Base de datos Chinook

In [2]:
!pip install SQLAlchemy==1.4.46

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting SQLAlchemy==1.4.46
  Downloading SQLAlchemy-1.4.46-cp310-cp310-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_17_x86_64.manylinux2014_x86_64.whl (1.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 14.2 MB/s eta 0:00:00
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from SQLAlchemy==1.4.46) (2.0.2)
Installing collected packages: SQLAlchemy
  Attempting uninstall: SQLAlchemy
    Found existing installation: SQLAlchemy 2.0.10
    Uninstalling SQLAlchemy-2.0.10:
      Successfully uninstalled SQLAlchemy-2.0.10
Successfully installed SQLAlchemy-1.4.46

In [3]:
#download the Chinook database
!git clone https://github.com/lerocha/chinook-database.git

Cloning into 'chinook-database'...
remote: Enumerating objects: 1960, done.
remote: Counting objects: 100% (75/75), done.
remote: Compressing objects: 100% (54/54), done.
remote: Total 1960 (delta 33), reused 50 (delta 21), pack-reused 1885
Receiving objects: 100% (1960/1960), 19.57 MiB | 13.92 MiB/s, done.
Resolving deltas: 100% (1277/1277), done.

In [4]:
# load the SQL magic extension
# https://github.com/catherinedevlin/ipython-sql
# this extension allows us to connect to DBs and issue SQL command
%load_ext sql
# now we can use the magic extension to connect to our SQLite DB
# use %sql to write an inline SQL command
# use %%sql to write SQL commands in a cell
%sql sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite

### Obteniendo información de tablas

In [5]:
%%sql 
PRAGMA table_info([Artist]);

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[(0, 'ArtistId', 'INTEGER', 1, None, 1),
 (1, 'Name', 'NVARCHAR(120)', 0, None, 0)]

In [6]:
%%sql
PRAGMA table_info([Employee]);

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[(0, 'EmployeeId', 'INTEGER', 1, None, 1),
 (1, 'LastName', 'NVARCHAR(20)', 1, None, 0),
 (2, 'FirstName', 'NVARCHAR(20)', 1, None, 0),
 (3, 'Title', 'NVARCHAR(30)', 0, None, 0),
 (4, 'ReportsTo', 'INTEGER', 0, None, 0),
 (5, 'BirthDate', 'DATETIME', 0, None, 0),
 (6, 'HireDate', 'DATETIME', 0, None, 0),
 (7, 'Address', 'NVARCHAR(70)', 0, None, 0),
 (8, 'City', 'NVARCHAR(40)', 0, None, 0),
 (9, 'State', 'NVARCHAR(40)', 0, None, 0),
 (10, 'Country', 'NVARCHAR(40)', 0, None, 0),
 (11, 'PostalCode', 'NVARCHAR(10)', 0, None, 0),
 (12, 'Phone', 'NVARCHAR(24)', 0, None, 0),
 (13, 'Fax', 'NVARCHAR(24)', 0, None, 0),
 (14, 'Email', 'NVARCHAR(60)', 0, None, 0)]



### Modelo relacional de Chinook [schemaspy](https://schemaspy.org/)

<img src="https://schemaspy.org/sample/diagrams/summary/relationships.real.large.png" alt="ER Diagram" width="836" height="605" />



# Soluciones consultas SQL

Para cada consulta seleccionada, indique el numero de la consulta, el enunciado y el codigo SQL que resuelve la consulta. A modo de ejemplo utilice el siguiente formato.

X) Escriba una consulta que muestre solo los Clientes de Brasil.

In [7]:
%%sql 
select * from Customer WHERE Country = "Brazil";

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (10, 'Eduardo', 'Martins', 'Woodstock Discos', 'Rua Dr. Falcão Filho, 155', 'São Paulo', 'SP', 'Brazil', '01007-010', '+55 (11) 3033-5446', '+55 (11) 3033-4564', 'eduardo@woodstock.com.br', 4),
 (11, 'Alexandre', 'Rocha', 'Banco do Brasil S.A.', 'Av. Paulista, 2022', 'São Paulo', 'SP', 'Brazil', '01310-200', '+55 (11) 3055-3278', '+55 (11) 3055-8131', 'alero@uol.com.br', 5),
 (12, 'Roberto', 'Almeida', 'Riotur', 'Praça Pio X, 119', 'Rio de Janeiro', 'RJ', 'Brazil', '20040-020', '+55 (21) 2271-7000', '+55 (21) 2271-7070', 'roberto.almeida@riotur.gov.br', 3),
 (13, 'Fernanda', 'Ramos', None, 'Qe 7 Bloco G', 'Brasília', 'DF', 'Brazil', '71020-677', '+55 (61) 3363-5547', '+55 (61) 3363-7855', 'fernadaramos4@uol.com.br', 4)]

1) ...

In [14]:
%%sql
select a.Name 'Artista', sum(li.UnitPrice) 'Total vendido'
from InvoiceLine as li
join Track using (TrackId)
join Album using (AlbumId)
join Artist as a using (ArtistId)
group by a.Name
order by count(a.ArtistId) Desc
limit 10;

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[('Iron Maiden', 138.5999999999998),
 ('U2', 105.92999999999982),
 ('Metallica', 90.0899999999999),
 ('Led Zeppelin', 86.12999999999992),
 ('Os Paralamas Do Sucesso', 44.550000000000004),
 ('Deep Purple', 43.56),
 ('Faith No More', 41.58),
 ('Lost', 81.58999999999997),
 ('Eric Clapton', 39.599999999999994),
 ('R.E.M.', 38.60999999999999)]

2) ...

In [15]:
%%sql
select g.Name 'Generos', count(t.GenreId) 'Total de canciones'
from Track as t 
join Genre as g using (GenreId)
group by g.Name

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[('Alternative', 40),
 ('Alternative & Punk', 332),
 ('Blues', 81),
 ('Bossa Nova', 15),
 ('Classical', 74),
 ('Comedy', 17),
 ('Drama', 64),
 ('Easy Listening', 24),
 ('Electronica/Dance', 30),
 ('Heavy Metal', 28),
 ('Hip Hop/Rap', 35),
 ('Jazz', 130),
 ('Latin', 579),
 ('Metal', 374),
 ('Opera', 1),
 ('Pop', 48),
 ('R&B/Soul', 61),
 ('Reggae', 58),
 ('Rock', 1297),
 ('Rock And Roll', 12),
 ('Sci Fi & Fantasy', 26),
 ('Science Fiction', 13),
 ('Soundtrack', 43),
 ('TV Shows', 93),
 ('World', 28)]

3) ...

In [40]:
%%sql
select c.FirstName || ' ' || c.LastName 'Cliente', sum(i.Total) 'Total gastado'
from Invoice as i
join Customer as c using (CustomerId)
group by CustomerId
order by sum(i.Total) desc
limit 5;

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[('Helena Holý', 49.620000000000005),
 ('Richard Cunningham', 47.620000000000005),
 ('Luis Rojas', 46.62),
 ('Ladislav Kovács', 45.62),
 ("Hugh O'Reilly", 45.62)]

4) ...

In [49]:
%%sql
SELECT City, COUNT(*) 'Numero clientes'
FROM customer
GROUP BY City
ORDER BY COUNT(*) DESC
LIMIT 1;

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[('São Paulo', 2)]

5) ...

In [63]:
%%sql
select c.FirstName || ' ' || c.LastName 'Cliente', SUM(li.Quantity) 'Pistas Totales'
from InvoiceLine as li
join Invoice using (InvoiceId)
join Customer as c using (CustomerId)
group by c.CustomerID

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[('Luís Gonçalves', 38),
 ('Leonie Köhler', 38),
 ('François Tremblay', 38),
 ('Bjørn Hansen', 38),
 ('František Wichterlová', 38),
 ('Helena Holý', 38),
 ('Astrid Gruber', 38),
 ('Daan Peeters', 38),
 ('Kara Nielsen', 38),
 ('Eduardo Martins', 38),
 ('Alexandre Rocha', 38),
 ('Roberto Almeida', 38),
 ('Fernanda Ramos', 38),
 ('Mark Philips', 38),
 ('Jennifer Peterson', 38),
 ('Frank Harris', 38),
 ('Jack Smith', 38),
 ('Michelle Brooks', 38),
 ('Tim Goyer', 38),
 ('Dan Miller', 38),
 ('Kathy Chase', 38),
 ('Heather Leacock', 38),
 ('John Gordon', 38),
 ('Frank Ralston', 38),
 ('Victor Stevens', 38),
 ('Richard Cunningham', 38),
 ('Patrick Gray', 38),
 ('Julia Barnett', 38),
 ('Robert Brown', 38),
 ('Edward Francis', 38),
 ('Martha Silk', 38),
 ('Aaron Mitchell', 38),
 ('Ellie Sullivan', 38),
 ('João Fernandes', 38),
 ('Madalena Sampaio', 38),
 ('Hannah Schneider', 38),
 ('Fynn Zimmermann', 38),
 ('Niklas Schröder', 38),
 ('Camille Bernard', 38),
 ('Dominique Lefebvre', 38),
 ('Marc Dubois', 38),
 ('Wyatt Girard', 38),
 ('Isabelle Mercier', 38),
 ('Terhi Hämäläinen', 38),
 ('Ladislav Kovács', 38),
 ("Hugh O'Reilly", 38),
 ('Lucas Mancini', 38),
 ('Johannes Van der Berg', 38),
 ('Stanisław Wójcik', 38),
 ('Enrique Muñoz', 38),
 ('Joakim Johansson', 38),
 ('Emma Jones', 38),
 ('Phil Hughes', 38),
 ('Steve Murray', 38),
 ('Mark Taylor', 38),
 ('Diego Gutiérrez', 38),
 ('Luis Rojas', 38),
 ('Manoj Pareek', 38),
 ('Puja Srivastava', 36)]

6) ...

In [93]:
%%sql
select p.Name, SUM(t.Milliseconds) / 1000 AS Tiempo
from Playlist as p
join PlaylistTrack as pt using (PlaylistId)
join Track as t using (TrackId)
GROUP BY p.Name
ORDER BY Tiempo DESC
LIMIT 1;

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[('Music', 1755366)]

7) ...

In [98]:
%%sql
select a.Name 'Artista', count(t.TrackId) 'Numero canciones'
from Artist as a
join Album using (ArtistId)
join Track as t using (AlbumId)
GROUP BY a.ArtistId
ORDER BY COUNT(t.TrackId) DESC
LIMIT 1;

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[('Iron Maiden', 213)]

8) ...

In [107]:
%%sql
select a.Name 'Artista', COUNT(distinct al.AlbumId) as Numero_Albunes
from Artist as a
join Album as al using(ArtistId)
group by a.ArtistId
order by Numero_Albunes desc
limit 10;

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[('Iron Maiden', 21),
 ('Led Zeppelin', 14),
 ('Deep Purple', 11),
 ('Metallica', 10),
 ('U2', 10),
 ('Ozzy Osbourne', 6),
 ('Pearl Jam', 5),
 ('Various Artists', 4),
 ('Faith No More', 4),
 ('Foo Fighters', 4)]

9) ...

In [117]:
%%sql
select g.Name 'Genero', SUM(il.Quantity) as VentasTotales
from Invoice as i
join InvoiceLine as il using (InvoiceId)
join Track as t using (TrackId)
join Genre as g using (GenreId)
group by g.GenreId
order by VentasTotales desc
limit 5;

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[('Rock', 835),
 ('Latin', 386),
 ('Metal', 264),
 ('Alternative & Punk', 244),
 ('Jazz', 80)]

10) ...

In [119]:
%%sql
select c.City, SUM(il.Quantity) as VentasTotales
from Invoice as i
join InvoiceLine as il using (InvoiceId)
join Customer as c using (CustomerId)
group by c.City
order by VentasTotales desc
limit 1;

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[('São Paulo', 76)]

11) ...

In [123]:
%%sql
select p.Name 'Playlist', COUNT(pt.TrackId) as PistasTotales
from Playlist as p
join PlaylistTrack as pt using (PlaylistId)
group by p.PlaylistId
order by PistasTotales desc
limit 1;

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[('Music', 3290)]

12) ...

In [129]:
%%sql
-- Álbum con la mayor duración total de canciones
select a.Title 'Album', SUM(t.Milliseconds)/1000 as DuracionTotal
from Album as a
join Track as t using (AlbumId)
group by a.AlbumId
order by DuracionTotal desc
limit 1;

-- Álbum con la menor duración total de canciones
select a.Title 'Album', SUM(t.Milliseconds)/1000 as DuracionTotal
from Album as a
join Track as t using (AlbumId)
group by a.AlbumId
order by DuracionTotal asc
limit 1;

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.
Done.

[("Liszt - 12 Études D'Execution Transcendante", 51)]

13) ...

In [ ]:
%%sql
select ...

14) ...

In [ ]:
%%sql
select ...

15) ...

In [ ]:
%%sql
select ...

16) ...

In [ ]:
%%sql
select ...

17) ...

In [ ]:
%%sql
select ...

18) ...

In [ ]:
%%sql
select ...

19) ...

In [ ]:
%%sql
select ...

20) ...

In [ ]:
%%sql
select ...

21) ...

In [ ]:
%%sql
select ...

22) ...

In [ ]:
%%sql
select ...

23) ...

In [ ]:
%%sql
select ...

24) ...

In [ ]:
%%sql
select ...

25) ...

In [ ]:
%%sql
select ...

26) ...

In [ ]:
%%sql
select ...

27) ...

In [ ]:
%%sql
select ...

28) ...

In [ ]:
%%sql
select ...

29) ...

In [ ]:
%%sql
select ...

30) ...

In [ ]:
%%sql
select ...